mafeiGitHub/stm32Mp3/src/main.cpp
    // wait for file change
    while (fileIndex == loadedFileIndex)
      osDelay (100);
    }
  }
//}}}

//{{{
static void aacLoadThread (void const* argument) {

  cLcd::debug ("aacLoadThread");

  cHttp http;
  while (true) {
    if (hlsRadio->getChan() != hlsRadio->mTuneChan)
      hlsRadio->mPlayFrame = hlsRadio->changeChan (&http, hlsRadio->mTuneChan) - hlsRadio->getFramesFromSec(19);

    cLcd::debug ("aacLoadThread chan " + cLcd::dec (hlsRadio->getChan()));
    hlsRadio->setBitrate (128000);

    if (!hlsRadio->load (&http, hlsRadio->mPlayFrame))
      osDelay (1000);

    hlsRadio->mRxBytes = http.getRxBytes();
    cLcd::debug ("aac loaded " + cLcd::dec (hlsRadio->mRxBytes));
    osSemaphoreWait (loadedSem, osWaitForever);
    }
  }
//}}}
//{{{
static void aacPlayThread (void const* argument) {

  cLcd::debug ("aacPlayThread");

  int curVol = hlsRadio->mTuneVol;

  #ifdef STM32F746G_DISCO
    BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_HEADPHONE, int(mVolume * 100), 44100);
    BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_02);
  #else
    BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_SPEAKER, int(mVolume * 100), 44100);
    BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_13);
  #endif

  // should be 8192
  memset ((void*)AUDIO_BUFFER, 0, 8192);
  BSP_AUDIO_OUT_Play ((uint16_t*)AUDIO_BUFFER, 8192);

  int lastSeqNum = 0;
  while (true) {
    if (osSemaphoreWait (mAudSem, 50) == osOK) {
      int seqNum;
      int16_t* audioPtr = (int16_t*)(mAudHalf ? AUDIO_BUFFER : AUDIO_BUFFER + 4096);
      int16_t* audioSamples = hlsRadio->getAudioSamples (hlsRadio->mPlayFrame, seqNum);
      if (hlsRadio->mPlaying && audioSamples) {
        memcpy (audioPtr, audioSamples, 4096);
        hlsRadio->mPlayFrame++;
        }
      else
        memset (audioPtr, 0, 4096);

      if (!seqNum ||(seqNum != lastSeqNum)) {
        //hlsRadio->setBitrateStrategy2 (seqNum != lastSeqNum+1);
        lastSeqNum = seqNum;
        osSemaphoreRelease (loadedSem);
        }
      }

    if (curVol != hlsRadio->mTuneVol) {
      BSP_AUDIO_OUT_SetVolume (hlsRadio->mTuneVol);
      curVol = hlsRadio->mTuneVol;
      }
    }
  }
//}}}
//{{{
static void netThread (void const* argument) {

  tcpip_init (NULL, NULL);
  cLcd::debug ("configuring ethernet");

  // init LwIP stack
  struct ip_addr ipAddr;
  IP4_ADDR (&ipAddr, 192, 168, 1, 67);
  struct ip_addr netmask;
  IP4_ADDR (&netmask, 255, 255 , 255, 0);
  struct ip_addr gateway;
  IP4_ADDR (&gateway, 192, 168, 0, 1);

  struct netif netIf;
  netif_add (&netIf, &ipAddr, &netmask, &gateway, NULL, &ethernetif_init, &tcpip_input);
  netif_set_default (&netIf);

  if (netif_is_link_up (&netIf)) {
    netif_set_up (&netIf);
    if (kStaticIp)
      //{{{  static ip
      cLcd::debug (COL_YELLOW, "ethernet static ip " + cLcd::dec ((int) (netIf.ip_addr.addr & 0xFF)) + "." +
                                                       cLcd::dec ((int)((netIf.ip_addr.addr >> 16) & 0xFF)) + "." +
                                                       cLcd::dec ((int)((netIf.ip_addr.addr >> 8) & 0xFF)) + "." +
                                                       cLcd::dec ((int) (netIf.ip_addr.addr >> 24)));
      //}}}
    else {
      //{{{  dhcp ip
      struct ip_addr nullIpAddr;
      IP4_ADDR (&nullIpAddr, 0, 0, 0, 0);
      netIf.ip_addr = nullIpAddr;
      netIf.netmask = nullIpAddr;
      netIf.gw = nullIpAddr;
      dhcp_start (&netIf);

      while (true) {
        if (netIf.ip_addr.addr) {
          //{{{  dhcp allocated
          cLcd::debug (COL_YELLOW, "dhcp allocated " + cLcd::dec ( (int)(netIf.ip_addr.addr & 0xFF)) + "." +
                                                       cLcd::dec ((int)((netIf.ip_addr.addr >> 16) & 0xFF)) + "." +
                                                       cLcd::dec ((int)((netIf.ip_addr.addr >> 8) & 0xFF)) + "." +
                                                       cLcd::dec ( (int)(netIf.ip_addr.addr >> 24)));
          dhcp_stop (&netIf);
          break;
          }
          //}}}
        else if (netIf.dhcp->tries > 4) {
          //{{{  dhcp timeout
          cLcd::debug (COL_RED, "dhcp timeout");
          dhcp_stop (&netIf);

          // use static address
          struct ip_addr ipAddr;
          IP4_ADDR (&ipAddr, 192 ,168 , 1 , 67 );
          struct ip_addr netmask;
          IP4_ADDR (&netmask, 255, 255, 255, 0);
          struct ip_addr gateway;
          IP4_ADDR (&gateway, 192, 168, 0, 1);
          netif_set_addr (&netIf, &ipAddr , &netmask, &gateway);
          break;
          }
          //}}}
        osDelay (250);
        }
      }
      //}}}

    //httpServerInit();
    const osThreadDef_t osThreadAacLoad =  { (char*)"AacLoad", aacLoadThread, osPriorityNormal, 0, 15000 };
    osThreadCreate (&osThreadAacLoad, NULL);
    const osThreadDef_t osThreadAacPlay =  { (char*)"AacPlay", aacPlayThread, osPriorityAboveNormal, 0, 2000 };
    osThreadCreate (&osThreadAacPlay, NULL);
    }
  else {
    //{{{  no ethernet
    netif_set_down (&netIf);
    cLcd::debug (COL_RED, "no ethernet");
    }
    //}}}

  osThreadTerminate (NULL);
  }
//}}}

// waveform
//int frames = 0;
//uint8_t* power = nullptr;
//int frame = hlsRadio->mPlayFrame - lcdGetXSize()/2;
//for (auto x = 0; x < lcdGetXSize(); x++, frame++) {
//  if (frames <= 0)
//    power = hlsRadio->getPower (frame, frames);
//  if (power) {
//    uint8_t top = *power++;
//    uint8_t ylen = *power++;
//   lcdRect (LCD_BLUE, x, top, 1, ylen);
//   frames--;
//   }
// }

//lcdString (hlsRadio->getLoading() ? LCD_GREY : LCD_WHITE,
//           20, hlsRadio->getInfoStr (hlsRadio->mPlayFrame).c_str(), 0, 0, lcdGetXSize(), 24);
//lcdString (LCD_WHITE, 20, hlsRadio->getChunkInfoStr (0).c_str(), 0, lcdGetYSize()-120, lcdGetXSize(), 24);
//lcdString (LCD_WHITE, 20, hlsRadio->getChunkInfoStr (1).c_str(), 0, lcdGetYSize()-96, lcdGetXSize(), 24);
//lcdString (LCD_WHITE, 20, hlsRadio->getChunkInfoStr (2).c_str(), 0, lcdGetYSize()-72, lcdGetXSize(), 24);
//lcdString (LCD_WHITE, 20, hlsRadio->getChanInfoStr().c_str(), 0, lcdGetYSize()-48, lcdGetXSize(), 24);

